
def card_game():
    # 初始欢迎信息
    print("==============================")
    print("    欢迎来到卡牌游戏！    ")
    print("==============================\n")
    print("请选择你想要游玩的游戏")
    print("输入‘1’游玩BlackJack，输入‘2’游玩UNO")
    input()  # 等待用户输入

    print("\n==============================")
    print("    欢迎来到BlackJack游戏！")
    print("==============================\n")

    

    # 游戏介绍
    print("在这个游戏中，你将从牌堆中获取卡牌，直到你的卡牌总点数达到21点，或者尽可能接近但不超过21点。")
    print("准备好与庄家一决胜负了吗？\n")

    print("-------请输入玩家人数--------")
    input()  # 等待用户输入 2

    # 选择游戏模式
    print("-------请选择游戏模式--------")
    print("-        1.简单模式         -")
    print("-        2.赌徒模式         -")
    print("-        3.安全模式         -")
    print("-----------------------------")
    input()  # 等待用户输入3

    # 玩家回合开始
    print("现在是玩家1的回合")
    print("-----------------------------")
    print("-        1.开始游戏         -")
    print("-        2.结束游戏         -")
    print("-        3.查看余额         -")
    print("-----------------------------")
    input()  # 等待用户输入1

    # 游戏开始
    print("游戏开始！\n")

    print("请选择您的赌注（注意：赌注只能为10的倍数！)")
    input()#10

    print("庄家的手牌为：")
    print("1.未知")
    print("2.梅花 A\n")

    print("您的手牌为： 点数13")
    print("1.红桃 7")
    print("2.方块 6")
    print("您不能选择分牌。\n")

    print("请选择您的操作")
    print("1.要牌 2.停牌 3.保险")
    input()  # 等待用户输入3
    print("---------------\n")
    print("请选择您的操作")
    print("1.要牌 2.停牌 3.加倍 4.投降")
    input() #1
    print("---------------\n")

    print("您的手牌为： 点数23")
    print("1.红桃 7")
    print("2.方块 6")
    print("3.黑桃 Q")
    print("玩家1输掉了本局游戏")


    print("现在是玩家2的回合")
    print("-----------------------------")
    print("-        1.开始游戏         -")
    print("-        2.结束游戏         -")
    print("-        3.查看余额         -")
    print("-----------------------------")
    input()  # 等待用户输入1


    print("\n游戏开始！\n")

    print("请选择您的赌注（注意：赌注只能为10的倍数！)")
    input()#50


    print("\n您的手牌为： 点数12")
    print("1.红桃 4")
    print("2.黑桃 8")
    print("您不能选择分牌。\n")

    print("请选择您的操作")
    print("1.要牌 2.停牌 3.保险")
    input()  # 等待用户输入2

    # 显示庄家的手牌
    print("---------------\n")
    print("庄家的手牌为: 点数19")
    print("1.梅花 8")
    print("2.梅花 A\n")

    print("玩家1输掉了本局游戏")
    print("玩家1输掉了15元，剩余985元")
    print("玩家2输掉了本局游戏")
    print("玩家2输掉了50元，剩余950元")

    print("-------请选择游戏模式--------")
    print("-        1.简单模式         -")
    print("-        2.赌徒模式         -")
    print("-        3.安全模式         -")
    print("-----------------------------")
    input();


# 运行游戏
card_game()